[
    {
        "companyName": "Doeasily",
        "logoSrc": "./ExperienceImg/doeasilyLogo.png",
        "position": "Frontend Developer - INTERNSHIP",
        "duration": "August 2023 - October 2023",
        "location": "Bengaluru, Karnataka, India",
        "projects": [
            {
                "name": "Doeasily, Business made easy",
                "link": "https://doeasily.in/login",
                "description": [
                    "Implementing new features for customers to track their jewelry purchase and sale history.",
                    "Enhancing the codebase and elevating the user interface to optimize user experience.",
                    "Introducing table and tile views for ledger access, enabling customers to seamlessly review their purchase and sale records.",
                    "Establishing an onboarding procedure to facilitate a smooth initiation for new customers when they embark on using the application.",
                    "Implemented keyboard shortcuts for enhanced user interaction and efficiency."
                ],
                "technologiesUsed": [
                    "React",
                    "MUI",
                    "Recoil",
                    "Git"
                ]
            }
        ]
    },
    {
        "companyName": "Bookee",
        "logoSrc": "./ExperienceImg/bookeeLogo.png",
        "position": "Software Developer Engineer (Frontend) - INTERNSHIP",
        "duration": "March 2023 - June 2023",
        "location": "Bengaluru, Karnataka, India",
        "projects": [
            {
                "name": "Bookee CRM",
                "link": "https://crm.bookeeapp.com/",
                "description": [
                    "Utilized Angular framework to create responsive user interfaces for a CRM application, guaranteeing seamless user experience across variousdevices and browsers.",
                    "Worked together with backend developers and designers to fuse frontend components with backend REST APIs, ensuring smooth dataflow and system functionality.",
                    "Enhanced UI features, such as dynamic form validations and datafiltering.",
                    "Handling STRIPE payment and integrate innovative features such as introducing a referral system and enabling the addition of digital signatures on forms. - React.js",
                    "Actively participated in agile development processes, attending daily stand-ups, sprint planning, and retrospectives to effectively deliver features within project timelines."
                ],
                "technologiesUsed": [
                    "Angular",
                    "Bootstrap",
                    "Sass",
                    "TypeScript",
                    "Git"
                ]
            },
            {
                "name": "Embed",
                "link": "https://halofitnessbrooklyn.weebly.com/reserve.html#/login",
                "description": [
                    "Initiate REST APIs requests.",
                    "Manage form validation errors.",
                    "Resolve user interface anomalies.",
                    "Integrate innovative features such as introducing a referral system and enabling the addition of digital signatures on forms."
                ],
                "technologiesUsed": [
                    "React",
                    "Redux",
                    "JavaScript",
                    "CSS3",
                    "Git"
                ]
            }
        ]
    },
    {
        "companyName": "Talent Sumo",
        "logoSrc": "./ExperienceImg/tsLogo.png",
        "position": "Frontend Developer - INTERNSHIP",
        "duration": "June 2022 - Feb 2023",
        "location": "Nagpur, Maharashtra, India",
        "projects": [
            {
                "name": "CLOUD COACH",
                "link": "https://sandbox.coachbots.com/login",
                "description": [
                    "Designed and developed a comprehensive user interface facilitating end-to-end functionality for an AI bot specialized in automatic assessment and feedback. Application areas include interview preparation, sales and leadership training, course testing, job screening, and simulations.",
                    "Implementing Open AI feature to leverage the power of application to provide the AI capabilities.",
                    "Crafted a user-friendly UX (User Experience) to enhance accessibility and ease of interaction.",
                    "Engineered a highly responsive user interface adaptable to various devices, ensuring seamless user experiences across platforms.",
                    "Implemented robust features for video and audio recording within the application, enhancing its versatility and effectiveness for users.",
                    "Integrated secure login and signup functionality to manage user authentication and access control effectively."
                ],
                "technologiesUsed": [
                    "HTML5",
                    "CSS3",
                    "Bootstrap",
                    "Material-UI",
                    "React",
                    "OpenAI"
                ]
            }
        ]
    },
    {
        "companyName": "GMAT Verzeo",
        "logoSrc": "./ExperienceImg/vLogo.png",
        "position": "Web Developer - APPRENTICESHIP",
        "duration": "May 2020 - July 2020",
        "location": "Bengaluru, Karnataka, India",
        "projects": [
            {
                "name": "Verzeo Web Development Course",
                "description": [
                    "I completed a comprehensive two-month online course centered on web development technologies, gaining proficiency in HTML5, CSS3, Bootstrap, JavaScript, DOM manipulation, AJAX, and jQuery."
                ],
                "technologiesUsed": [
                    "HTML5",
                    "CSS3",
                    "Bootstrap",
                    "JavaScript",
                    "jQuery"
                ]
            }
        ]
    }
]